
GetPassphraseDescription = "Uma senha é necessária para desbloquear a chave secreta do usuário “%@”, ID %@";
GetPassphraseDescription_Subkey = "Uma senha é necessária para desbloquear a chave secreta do usuário “%@”, ID %@, (ID da chave principal %@)";
PassphraseLabel = "Senha:";




/* For Key-Status */
"Invalid" = "Inválida";
"Revoked" = "Revogada";
"Expired" = "Vencida";
"Disabled" = "Desativada";
"Unknown" = "Desconhecida";
"Never" = "Nunca";
"Marginal" = "Questionável";
"Full" = "Total";
"Ultimate" = "Fundamental";


/* For Undo and Redo */
Undo_NewKey = "Nova Chave";
Undo_Delete = "Apagar";
Undo_CleanKey = "Limpar";
Undo_MinimizeKey = "Minimizar";
Undo_RevokeKey = "Revogar Chave";
Undo_ChangeExpirationDate = "Alterar Vencimento";
Undo_ChangePassphrase = "Alterar Senha";
Undo_AlgorithmPreferences = "Alterar Preferências do Algoritmo";
Undo_Import = "Importar";
Undo_AddSignature = "Adicionar Assinatura";
Undo_RemoveSignature = "Remover Assinatura";
Undo_RevokeSignature = "Revogar Assinatura";
Undo_AddSubkey = "Adicionar Subchave";
Undo_RemoveSubkey = "Remover Subchave";
Undo_RevokeSubkey = "Revogar Subchave";
Undo_AddUserID = "Adicionar ID de Usuário";
Undo_RemoveUserID = "Remover ID de Usuário";
Undo_RevokeUserID = "Revogar ID de Usuário";
Undo_PrimaryUserID = "ID de Usuário Principal";
Undo_AddPhoto = "Adicionar Foto";
Undo_RefreshFromServer = "Atualizar do Servidor";
Undo_ReceiveFromServer = "Receber do Servidor";



/* Algorithm names */
CIPHER_ALGO_NONE = "Nenhum";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Nenhuma";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algoritmo_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Assinada";
"Signature expired" = "Assinatura vencida";
"Key expired" = "Chave vencida";
"Bad signature" = "A assinatura não corresponde aos dados. Isso indica uma possível adulteração dos dados.";
"Signature revoked" = "Assinatura revogada";
"Signature error" = "Erro de assinatura";
"Unverifiable signature" = "A assinatura não pode ser verificada.";
"Signed by stranger" = "A assinatura não pode ser verificada porque falta a chave pública correspondente.";


/* Key Descriptions */
KeyDescriptionAndMore = "e mais %lu";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Aviso: sua chave está prestes a expirar";
KeyExpiryWarning_Msg = "A chave expirará em %1$@:\n\n%2$@\n\nChaves expiradas não podem ser usadas para criptografar ou assinar novas mensagens. A descriptografia continuará funcionando. Seus amigos não poderão mais usar esta chave para enviar mensagens criptografadas.\n\nCaso opte por prorrogar a chave, ela será válida por mais dois anos.\n\nDeseja prorrogar a chave?";
KeyExpiryWarning_Yes = "Prorrogar Chave";
KeyExpiryWarning_No = "Cancelar";
KeyExpiryWarning_Suppress = "Não Perguntar Novamente";

SubkeyExpiryWarning_Title = "Aviso: sua subchave está prestes a expirar";
SubkeyExpiryWarning_Msg = "A subchave expirará em %1$@:\n\n%2$@\n\nSubchaves expiradas não podem ser usadas para criptografar ou assinar novas mensagens. A descriptografia continuará funcionando. Seus amigos não poderão mais usar esta subchave para enviar mensagens criptografadas.\n\nCaso opte por prorrogar a subchave, ela será válida por mais dois anos.\n\nDeseja prorrogar a subchave?";
SubkeyExpiryWarning_Yes = "Prorrogar Subchave";
SubkeyExpiryWarning_No = "Cancelar";
SubkeyExpiryWarning_Suppress = "Não Perguntar Novamente";

WrongPasswordTryAgain_Title = "Você digitou a senha errada";
WrongPasswordTryAgain_Msg = "Deseja tentar novamente?";
WrongPasswordTryAgain_Yes = "Tentar Novamente";
WrongPasswordTryAgain_No = "Cancelar";

KeyExpiryFailed_Title = "Falha ao prorrogar a chave";
KeyExpiryFailed_Msg = "A chave\n%1$@\nnão pôde ser prorrogada.\n\nErro: %2$@";

KeyExtendedWantToUpload_Title = "A chave foi prorrogada corretamente";
KeyExtendedWantToUpload_Msg = "Para que outras pessoas possam ver o vencimento novo, é preciso que elas importem a sua chave atualizada. Para isso, é recomendável enviar a sua chave pública atualizada aos servidores.\n\nAviso: pelos servidores serem públicos, o nome e o e-mail usados na chave poderão ser vistos publicamente. As chaves não poderão ser apagadas dos servidores de chaves, pois embora possam ser revogadas, elas não podem ser removidas.\n\nCaso prefira não usar servidores de chaves, anexe a sua chave pública ao enviar e-mails assinados e criptografados.\n\nDeseja enviar a chave pública atualizada?";
KeyExtendedWantToUpload_Yes = "Enviar Chave Pública";
KeyExtendedWantToUpload_No = "Não Enviar";

UploadFailed_Title = "Falha ao enviar a chave";
UploadFailed_Msg = "A chave não pôde ser enviada para o servidor.\n\nErro: %@";


UpdaterNotWorking_Title = "O atualizador da GPG Suite não está funcionando devidamente!";
UpdaterNotWorking_Msg = "Transfira e reinstale a GPG Suite de https://gpgtools.org.";


SwitchToOldKeyserver_Title = "Aviso: você está prestes a mudar o servidor de chaves";
SwitchToOldKeyserver_Msg = "A qualidade dos resultados da busca será reduzida ao mudar para o servidor de chaves antigo. Enquanto “keys.openpgpg.org” permite a verificação do endereço de e‑mail para somente depois mostrar o e‑mail nos resultados da busca, os servidores antigos não são compatíveis com esse mecanismo.\n\nÉ recomendável continuar usando “keys.openpgpg.org”\n\nDeseja realmente mudar o servidor de chaves?";
SwitchToOldKeyserver_No = "Cancelar";
SwitchToOldKeyserver_Yes = "Mudar para Servidor Antigo";


